RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_romapi_patch.c
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_380M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0xFD55 },        /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x17C00 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x13CAA }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x13000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0xE9D8 },        /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x17C00 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_400M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x10AAA },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x19000 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x14D55 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x14000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0xF627 },        /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x19000 }, /*!< XTAL is RC32M */
};
const GLB_WAC_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION cpuPllCfg_480M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                              /*!< XTAL is None */
    { &cpuPllBasicCfg_24M_26M, 0x14000 },       /*!< XTAL is 24M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1E000 }, /*!< XTAL is 32M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x19000 }, /*!< XTAL is 38.4M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x18000 }, /*!< XTAL is 40M */
    { &cpuPllBasicCfg_24M_26M, 0x12762 },       /*!< XTAL is 26M */
    { &cpuPllBasicCfg_32M_38P4M_40M, 0x1E000 }, /*!< XTAL is RC32M */
};

/* MIPI PLL Config*/
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_24M = {
    .clkpllRefdivRatio = 2,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_32M = {
    .clkpllRefdivRatio = 3,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_38P4M = {
    .clkpllRefdivRatio = 3,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_40M = {
    .clkpllRefdivRatio = 3,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION mipiPllBasicCfg_26M = {
    .clkpllRefdivRatio = 2,  /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2, /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 5,     /*!< pll_vco_speed */
    .clkpllEvenDivEn = 0,    /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 0, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION mipiPllCfg_1500M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                       /*!< XTAL is None */
    { &mipiPllBasicCfg_24M, 0x3E800 },   /*!< XTAL is 24M */
    { &mipiPllBasicCfg_32M, 0x46500 },   /*!< XTAL is 32M */
    { &mipiPllBasicCfg_38P4M, 0x3A980 }, /*!< XTAL is 38.4M */
    { &mipiPllBasicCfg_40M, 0x38400 },   /*!< XTAL is 40M */
    { &mipiPllBasicCfg_26M, 0x39B13 },   /*!< XTAL is 26M */
    { &mipiPllBasicCfg_32M, 0x46500 },   /*!< XTAL is RC32M */
};

/* uhs PLL 2100 Config*/
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION uhsPll2100BasicCfg_24M = {
    .clkpllRefdivRatio = 1,     /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2,    /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 7,        /*!< pll_vco_speed */
    .clkpllEvenDivEn = 1,       /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 2100/50, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION uhsPll2100BasicCfg_32M = {
    .clkpllRefdivRatio = 2,     /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2,    /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 7,        /*!< pll_vco_speed */
    .clkpllEvenDivEn = 1,       /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 2100/50, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION uhsPll2100BasicCfg_38P4M = {
    .clkpllRefdivRatio = 2,     /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2,    /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 7,        /*!< pll_vco_speed */
    .clkpllEvenDivEn = 1,       /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 2100/50, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION uhsPll2100BasicCfg_40M = {
    .clkpllRefdivRatio = 2,     /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2,    /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 7,        /*!< pll_vco_speed */
    .clkpllEvenDivEn = 1,       /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 2100/50, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION uhsPll2100BasicCfg_26M = {
    .clkpllRefdivRatio = 1,     /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2,    /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 7,        /*!< pll_vco_speed */
    .clkpllEvenDivEn = 1,       /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 2100/50, /*!< pll_even_div_ratio */
};
const GLB_MU_PLL_Cfg_Type ATTR_CLOCK_CONST_SECTION uhsPllCfg_2100M[GLB_XTAL_MAX] = {
    { NULL, 0x0 },                      /*!< XTAL is None */
    { &uhsPll2100BasicCfg_24M, 0x2BC00 },   /*!< XTAL is 24M */
    { &uhsPll2100BasicCfg_32M, 0x41A00 },   /*!< XTAL is 32M */
    { &uhsPll2100BasicCfg_38P4M, 0x36B00 }, /*!< XTAL is 38.4M */
    { &uhsPll2100BasicCfg_40M, 0x34800 },   /*!< XTAL is 40M */
    { &uhsPll2100BasicCfg_26M, 0x28627 },   /*!< XTAL is 26M */
    { &uhsPll2100BasicCfg_32M, 0x41A00 },   /*!< XTAL is RC32M */
};

/* uhs PLL 1400 Config*/
const GLB_MU_PLL_CFG_BASIC_Type ATTR_CLOCK_CONST_SECTION uhsPll1400MCfg_24M = {
    .clkpllRefdivRatio = 2,     /*!< pll_refdiv_ratio */
    .clkpllSelSampleClk = 2,    /*!< pll_sel_sample_clk */
    .clkpllVcoSpeed = 4,        /*!< pll_vco_speed */
    .clkpllEvenDivEn = 1,       /*!< pll_even_div_en */
    .clkpllEvenDivRatio = 1400/50, /*!< pll_even_div_ratio */
};
